Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: SSH tunneling only forwards the first host. Other replica set members must be directly reachable from the SSH server.
fr: Le tunneling SSH ne renvoie que le premier hôte. Les autres membres du jeu de répliques doivent être directement accessibles depuis le serveur SSH.
ko: SSH 터널링은 첫 번째 호스트만 전달합니다. 다른 복제 세트 멤버는 SSH 서버에서 직접 연결할 수 있어야 합니다.
tr: SSH tüneli yalnızca ilk sunucuyu yönlendirir. Diğer replica set üyelerine SSH sunucusundan doğrudan erişilebilir olmalıdır.
vi: SSH tunnel chỉ chuyển tiếp host đầu tiên. Các thành viên replica set khác phải truy cập được trực tiếp từ SSH server.
zh_hans: SSH 隧道仅转发第一个主机。其他副本集成员必须能从 SSH 服务器直接访问。
zh_hant: SSH 隧道僅會轉送第一個主機。其他複本集成員必須能從 SSH 伺服器直接連線。

source: Title 3
fr: Titre 3
ko: 제목 3
vi: Tiêu đề 3
zh_hans: 标题 3
zh_hant: 標題 3

source: Discard Changes…
fr: Jeter les modifications...

source: Extend Selection to Previous Statement
fr: Extendre la sélection à la déclaration précédente
ko: 이전 문까지 선택 확장
tr: Seçimi Önceki İfadeye Genişlet
vi: Mở rộng vùng chọn đến câu lệnh trước
zh_hans: 将所选内容扩展到上一条语句
zh_hant: 將所選範圍延伸至上一個陳述式

source: Select a query to see its full text and details.
fr: Sélectionnez une requête pour voir son texte complet et ses détails.
ko: 전체 텍스트와 세부사항을 볼 쿼리를 선택하십시오.
tr: Tam metnini ve ayrıntılarını görmek için bir sorgu seçin.
vi: Chọn một truy vấn để xem toàn văn và chi tiết.
zh_hans: 选择一个查询以查看其完整文本和详情。
zh_hant: 選擇一個查詢以查看其完整文字和詳細資訊。

source: Published to the team library
fr: Publié dans la bibliothèque de l'équipe
ko: 팀 라이브러리에 게시됨
tr: Takım kitaplığına yayınlandı
vi: Đã xuất bản lên thư viện nhóm
zh_hans: 已发布到团队库
zh_hant: 已發佈到團隊庫

source: Error
fr: Erreur
ko: 오류
tr: Hata
vi: Lỗi
zh_hans: 错误
zh_hant: 錯誤

source: Choose a folder containing .sql files
fr: Choisissez un dossier contenant des fichiers .sql
ko: .sql 파일이 포함된 폴더 선택
tr: .sql dosyaları içeren bir klasör seçin
vi: Chọn thư mục chứa tệp .sql
zh_hans: 选择包含.sql文件的文件夹
zh_hant: 選擇包含 .sql 檔案的資料夾

source: Compare structure or data
fr: Comparer la structure ou les données
ko: 구조 또는 데이터 비교
tr: Yapıyı veya veriyi karşılaştır
vi: So sánh cấu trúc hoặc dữ liệu
zh_hans: 比较结构或数据
zh_hant: 比較結構或資料

source: Find…
fr: Trouver...
ko: 찾기…
tr: Bul…
vi: Tìm…
zh_hans: 查找…
zh_hant: 尋找…

source: Your API key is sent unencrypted over http to this host.
fr: Votre clé API est envoyée non cryptée via http vers cet hôte.

source: Access Method
fr: Méthode d'accès
ko: 접근 방식
tr: Erişim Yöntemi
vi: Phương thức truy cập
zh_hans: 访问方式
zh_hant: 存取方式

source: The tunnel command stopped. Click to reconnect.
fr: La commande du tunnel a cessé. Cliquez pour vous reconnecter.

source: Copy privileges to %@
fr: Copier les privilèges vers %@
ko: %@에 권한 복사
tr: Yetkileri %@ hedefine kopyala
vi: Sao chép quyền sang %@
zh_hans: 将权限复制到 %@
zh_hant: 將權限複製到 %@

source: Toggle Inspector (⌘⌥I)
fr: Ouvrir l'inspecteur (⌘⌥I)
ko: 검사기 표시/숨기기(⌘⌥I)
vi: Bật/tắt thanh kiểm tra (⌘⌥I)
zh_hans: 切换检查器 (⌘⌥I)
zh_hant: 切換檢閱器 (⌘⌥I)

source: Allow %@?
fr: Autoriser %@?

source: Query Result Limit
fr: Limite des résultats de la requête
ko: 쿼리 결과 제한
tr: Sorgu Sonuç Limiti
vi: Giới hạn kết quả truy vấn
zh_hans: 查询结果限制
zh_hant: 查詢結果上限

source: Concurrent refresh needs a valid unique index on the view's columns, with no WHERE clause and no expressions.
fr: La mise à jour simultanée nécessite un index unique valide sur les colonnes de la vue, sans clause WHERE ni expressions.

source: Forgets which connections you opened and when. Sorting by Last Connected starts over.
fr: Oublie quelles connexions vous avez ouvertes et quand. L'affichage trié par dernière connexion recommence à zéro.
ko: 어떤 연결을 언제 열었는지 잊습니다. 마지막 연결 순 정렬도 처음부터 다시 시작합니다.
tr: Hangi bağlantıları ne zaman açtığınızı unutur. Son bağlanılana göre sıralama baştan başlar.
vi: Quên các kết nối bạn đã mở và thời điểm mở. Sắp xếp theo lần kết nối cuối sẽ bắt đầu lại.
zh_hans: 忘记你打开过哪些连接以及打开的时间。按“上次连接”排序将重新开始。
zh_hant: 忘記你開啟過哪些連線以及開啟的時間。依「上次連線」排序將重新開始。

source: Connect a Client…
fr: Connectez un client...
ko: 클라이언트 연결…
tr: İstemci Bağla…
vi: Kết nối client…
zh_hans: 连接客户端…
zh_hant: 連線用戶端…

source: The AWS region %@ is not enabled for this account.
fr: La région AWS %@ n'est pas activée pour ce compte.

# %lld row%@ affected
source: %1$lld row%2$@ affected
fr: %1$lld rang%2$@ affecté
ko: %1$lld개 행%2$@에 영향
tr: %lld satır%@ etkilendi
vi: %lld dòng%@ bị ảnh hưởng
zh_hans: %lld 行%@受影响
zh_hant: 已影響 %1$lld 列%2$@

source: Paste
fr: Coller
ko: 붙여넣기
tr: Yapıştır
vi: Dán
zh_hans: 粘贴
zh_hant: 貼上

source: The tunnel command must contain %@, where the local port goes.
fr: La commande du tunnel doit contenir %@, où va le port local.

source: Dump operations are only supported for PostgreSQL and Redshift connections.
fr: Les opérations de déversement ne sont prises en charge que pour les connexions PostgreSQL et Redshift.
ko: 덤프 작업은 PostgreSQL 및 Redshift 연결에서만 지원됩니다.
tr: Döküm işlemleri yalnızca PostgreSQL ve Redshift bağlantıları için desteklenir.
vi: Thao tác dump chỉ được hỗ trợ cho kết nối PostgreSQL và Redshift.
zh_hans: 转储操作仅支持 PostgreSQL 和 Redshift 连接。
zh_hant: 備份/還原操作僅支援 PostgreSQL 和 Redshift 連線。

source: Sync Off
fr: Désynchroniser
ko: 동기화 끔
tr: Eşitleme Kapalı
vi: Tắt đồng bộ
zh_hans: 同步已关闭
zh_hant: 同步已關閉

source: A data comparison reads tables only.
fr: Une comparaison de données ne lit que les tableaux.

source: The copy writes no INCLUDE clause here, so %@ are left out of the index.
fr: La copie ne contient pas de clause INCLUDE ici, donc %@ est omis de l'index.

source: Save As
fr: Enregistrer sous
ko: 다른 이름으로 저장
tr: Farklı Kaydet
vi: Lưu thành
zh_hans: 另存为
zh_hant: 另存新檔

source: Row scope
fr: Portée de rangée

source: This Mac
fr: Ce Mac
ko: 이 Mac
tr: Bu Mac
vi: Máy Mac này
zh_hans: 此 Mac
zh_hant: 這台 Mac

source: Algorithm
fr: Algorithme
ko: 알고리즘
tr: Algoritma
vi: Thuật toán
zh_hans: 算法
zh_hant: 演算法

source: Could not write %@.
fr: Impossible d'écrire %@.
ko: %@을(를) 쓸 수 없습니다.
tr: %@ yazılamadı.
vi: Không thể ghi %@.
zh_hans: 无法写入 %@。
zh_hant: 無法寫入 %@。

source: Optional
fr: Facultatif
ko: 선택 사항
tr: İsteğe bağlı
vi: Tùy chọn
zh_hans: 可选
zh_hant: 選用

source: Structure sync needs matching database types. %1$@ and %2$@ can be compared, but no script is generated.
fr: La synchronisation de la structure nécessite des types de bases de données correspondants. %1$@ et %2$@ peuvent être comparés, mais aucun script n'est généré.
ko: 구조 동기화에는 같은 데이터베이스 타입이 필요합니다. %@과(와) %@은(는) 비교할 수 있지만 스크립트는 생성되지 않습니다.
tr: Yapı eşitlemesi eşleşen veritabanı türleri gerektirir. %1$@ ve %2$@ karşılaştırılabilir ama betik üretilmez.
vi: Đồng bộ cấu trúc cần các loại cơ sở dữ liệu giống nhau. %1$@ và %2$@ có thể được so sánh, nhưng không có script nào được tạo.
zh_hans: 结构同步需要相同的数据库类型。%1$@ 和 %2$@ 可以比较，但不会生成脚本。
zh_hant: 結構同步需要相同的資料庫類型。%1$@ 和 %2$@ 可以比較，但不會產生指令稿。

source: Nothing to Draw
fr: Rien à dessiner

source: Connection successful
fr: Connexion réussie
ko: 연결 성공
tr: Bağlantı başarılı
vi: Kết nối thành công
zh_hans: 连接成功
zh_hant: 連線成功

source: Grant %1$@ on %2$@
fr: Accorder %1$@ sur %2$@
ko: %1$@ 권한을 %2$@에 부여
tr: %2$@ üzerinde %1$@ ver
vi: Cấp %1$@ trên %2$@
zh_hans: 在 %2$@ 上授予 %1$@
zh_hant: 在 %2$@ 上授予 %1$@

source: Row %@ is not an object.
fr: La ligne %@ n'est pas un objet.

source: Stop and Close
fr: Arrêter et fermer
ko: 중지하고 닫기
tr: Durdur ve Kapat
vi: Dừng và đóng
zh_hans: 停止并关闭
zh_hant: 停止並關閉

source: Waiting for your password
fr: En attente de votre mot de passe
ko: 암호 입력 대기 중
tr: Parolanız bekleniyor
vi: Đang chờ mật khẩu của bạn
zh_hans: 正在等待你的密码
zh_hant: 正在等待你的密碼

source: Database/Schema:
fr: Base de données/Schéma :
ko: 데이터베이스/스키마:
tr: Veritabanı/Şema:
vi: Cơ sở dữ liệu/Schema:
zh_hans: 数据库/Schema:
zh_hant: 資料庫/綱要：

source: Count
fr: Compter

source: Items
fr: Articles
ko: 항목
tr: Öğeler
vi: Mục
zh_hans: 项目
zh_hant: 項目

source: Cell Value
fr: Valeur de la cellule
ko: 셀 값
tr: Hücre Değeri
vi: Giá trị ô
zh_hans: 单元格值
zh_hant: 儲存格值

source: Compact Mode
fr: Mode compacte
ko: 컴팩트 모드
tr: Kompakt Mod
vi: Chế độ thu gọn
zh_hans: 紧凑模式
zh_hant: 緊湊模式

# %d of %d rows
source: %1$d of %2$d rows
fr: %1$d de %2$d lignes
ko: %1$d/%2$d행
tr: %d / %d satır
vi: %d trên %d hàng
zh_hans: %d / %d 行
zh_hant: %1$d / %2$d 列

source: Zoom in
fr: Zoom sur
ko: 확대
tr: Yakınlaştır
vi: Phóng to
zh_hans: 放大
zh_hant: 放大

source: Command
fr: Commande

source: %@ wants to run this.
fr: %@ veut exécuter ceci.

source: Drop %1$lld %2$@…
fr: Déposez %1$lld %2$@...
ko: %1$lld개의 %2$@ 삭제…
tr: %1$lld %2$@ Sil…
vi: Xoá %1$lld %2$@…
zh_hans: 删除 %1$lld 个%2$@…
zh_hant: 刪除 %1$lld 個%2$@…

source: Devices
fr: Appareils
ko: 기기
tr: Cihazlar
vi: Thiết bị
zh_hans: 设备
zh_hant: 裝置

source: Group
fr: Groupe
ko: 그룹
tr: Grup
vi: Nhóm
zh_hans: 分组
zh_hant: 群組

source: TablePro reads this file with a driver it downloads from the plugin registry.
fr: TablePro lit ce fichier avec un pilote qu'il télécharge du registre du plugin.

source: Show Structure
fr: Structure de l'émission
ko: 구조 보기
tr: Yapıyı Göster
vi: Hiện cấu trúc
zh_hans: 显示结构
zh_hant: 顯示結構

source: Self Time
fr: Temps personnel

source: Editor & Query
fr: Éditeur et requête
ko: 편집기 및 쿼리
tr: Düzenleyici ve Sorgu
vi: Trình soạn thảo & Truy vấn
zh_hans: 编辑器与查询
zh_hant: 編輯器與查詢

source: Refresh the table to see what was written. Saving again would write those rows a second time.
fr: Rechargez la table pour voir ce qui a été écrit. En sauvegardant à nouveau, ces lignes seraient écrites une deuxième fois.
ko: 무엇이 기록되었는지 보려면 테이블을 새로 고치십시오. 다시 저장하면 해당 행이 한 번 더 기록됩니다.
tr: Neyin yazıldığını görmek için tabloyu yenileyin. Yeniden kaydetmek bu satırları ikinci kez yazar.
vi: Hãy làm mới bảng để xem những gì đã được ghi. Lưu lần nữa sẽ ghi các dòng đó thêm một lần.
zh_hans: 刷新该表以查看写入了什么。再次保存会把这些行再写一遍。
zh_hant: 重新整理該資料表以查看寫入了什麼。再次儲存會把這些列再寫一遍。

source: Close Window
fr: Fermer la fenêtre
ko: 윈도우 닫기
tr: Pencereyi Kapat
vi: Đóng cửa sổ
zh_hans: 关闭窗口
zh_hant: 關閉視窗

source: The SSO session for profile "%@" has expired. Sign in with your browser?
fr: La session SSO pour le profil "%@" a expiré. Connectez-vous avec votre navigateur ?
ko: 프로필 "%@"의 SSO 세션이 만료되었습니다. 브라우저에서 로그인하시겠습니까?
tr: "%@" profilinin SSO oturumunun süresi doldu. Tarayıcınızla giriş yapmak ister misiniz?
vi: Phiên SSO của hồ sơ "%@" đã hết hạn. Đăng nhập bằng trình duyệt?
zh_hans: 配置文件 "%@" 的 SSO 会话已过期。要通过浏览器登录吗？
zh_hant: 設定檔「%@」的 SSO 工作階段已過期。要透過瀏覽器登入嗎？

source: Closing this tab will discard all unsaved changes.
fr: La fermeture de cette onglet supprimera toutes les modifications non enregistrées.
ko: 이 탭을 닫으면 저장하지 않은 모든 변경 사항이 폐기됩니다.
tr: Bu sekmeyi kapatmak tüm kaydedilmemiş değişiklikleri siler.
vi: Đóng tab này sẽ hủy tất cả thay đổi chưa lưu.
zh_hans: 关闭此标签页将丢弃所有未保存的更改。
zh_hant: 關閉此分頁將捨棄所有未儲存的變更。

source: Copy Rows
fr: Copier les lignes
ko: 행 복사
tr: Satırları Kopyala
vi: Sao chép hàng
zh_hans: 复制行
zh_hant: 複製列

source: Choose a target to compare against.
fr: Choisissez une cible à comparer.
ko: 비교 대상을 선택하십시오.
tr: Karşılaştırılacak hedefi seçin.
vi: Chọn đích để so sánh với.
zh_hans: 选择用于比较的目标。
zh_hant: 選擇用於比較的目標。

source: Concurrent refresh
fr: Récupération simultanée

source: Downloading plugin
fr: Téléchargement du plugin
ko: 플러그인 다운로드 중
tr: Eklenti indiriliyor
vi: Đang tải plugin
zh_hans: 正在下载插件
zh_hant: 正在下載外掛

source: %@ switches reconnect the session
fr: %@ les commutateurs reconnectent la session
ko: %@ 전환 시 세션이 다시 연결됩니다
tr: %@ değiştirmek oturumu yeniden bağlar
vi: Chuyển %@ sẽ kết nối lại phiên
zh_hans: 切换%@会重新连接会话
zh_hant: 切換%@會重新連線工作階段

source: All categories
fr: Toutes les catégories
ko: 모든 카테고리
tr: Tüm kategoriler
vi: Tất cả danh mục
zh_hans: 所有分类
zh_hant: 所有類別

source: Focus Border
fr: Bord de mise au point
ko: 포커스 테두리
tr: Odak Kenarlığı
vi: Viền khi chọn
zh_hans: 焦点边框
zh_hant: 焦點邊框

source: Failed to load %@
fr: Impossible de charger %@
ko: %@을(를) 불러오지 못했습니다
tr: %@ yüklenemedi
vi: Không thể tải %@
zh_hans: 加载 %@ 失败
zh_hant: 載入 %@ 失敗

source: Its columns pass the %@ bytes this engine can index.
fr: Ses colonnes passent les %@ octets que ce moteur peut indexer.

source: Formatter error: %@
fr: Erreur de formatage : %@
ko: 포맷터 오류: %@
tr: Biçimlendirici hatası: %@
vi: Lỗi định dạng: %@
zh_hans: 格式化错误: %@
zh_hant: 格式化錯誤：%@

source: A query is still running. Disconnecting cancels it.
fr: Une requête est toujours en cours. La déconnexion l'annule.
ko: 쿼리가 아직 실행 중입니다. 연결을 끊으면 취소됩니다.
tr: Bir sorgu hâlâ çalışıyor. Bağlantıyı kesmek onu iptal eder.
vi: Một truy vấn vẫn đang chạy. Ngắt kết nối sẽ huỷ nó.
zh_hans: 仍有查询在运行。断开连接会取消它。
zh_hant: 仍有查詢在執行。中斷連線會取消它。

source: Local File
fr: Fichier local
ko: 로컬 파일
tr: Yerel Dosya
vi: Tệp cục bộ
zh_hans: 本地文件
zh_hant: 本機檔案

source: Unsupported export format.
fr: Format d'exportation non pris en charge.
ko: 지원되지 않는 내보내기 형식입니다.
tr: Desteklenmeyen dışa aktarma biçimi.
vi: Định dạng xuất không được hỗ trợ.
zh_hans: 不支持的导出格式。
zh_hant: 不支援的匯出格式。

source: Move Tab Right
fr: Déplacez la barre d'onglets vers
ko: 탭 오른쪽으로 이동
tr: Sekmeyi Sağa Taşı
vi: Chuyển tab sang phải
zh_hans: 将标签页右移
zh_hant: 將標籤頁右移

source: Saved Connections
fr: Connections enregistrées
ko: 저장된 연결
tr: Kayıtlı Bağlantılar
vi: Kết nối đã lưu
zh_hans: 已保存的连接
zh_hant: 已儲存的連線

source: The file is copied to this Mac and opened read-only. The original on the server is never written to.
fr: Le fichier est copié sur ce Mac et ouvert en lecture seule. L'original sur le serveur n'est jamais écrit.
ko: 파일이 이 Mac으로 복사되어 읽기 전용으로 열립니다. 서버의 원본에는 절대 쓰지 않습니다.
tr: Dosya bu Mac'e kopyalanır ve salt okunur açılır. Sunucudaki özgün dosyaya asla yazılmaz.
vi: Tệp được sao chép về máy Mac này và mở ở chế độ chỉ đọc. Bản gốc trên máy chủ không bao giờ bị ghi vào.
zh_hans: 该文件会被复制到这台 Mac 并以只读方式打开。服务器上的原始文件绝不会被写入。
zh_hant: 該檔案會被複製到這台 Mac 並以唯讀方式開啟。伺服器上的原始檔案絕不會被寫入。

source: Hide Sidebar
fr: Masquer la barre latérale
ko: 사이드바 가리기
tr: Kenar Çubuğunu Gizle
vi: Ẩn thanh bên
zh_hans: 隐藏侧边栏
zh_hant: 隱藏側邊欄

source: Reset Zoom
fr: Réinitialiser Zoom
ko: 확대/축소 재설정
tr: Yakınlaştırmayı Sıfırla
vi: Đặt lại thu phóng
zh_hans: 重置缩放
zh_hant: 重設縮放

source: No triggers
fr: Pas de déclencheurs
ko: 트리거 없음
tr: Tetikleyici yok
vi: Không có trigger
zh_hans: 没有触发器
zh_hant: 沒有觸發器

source: Local port must be between 1 and 65535
fr: Le port local doit être entre 1 et 65535.
ko: 로컬 포트는 1에서 65535 사이여야 합니다
tr: Yerel port 1 ile 65535 arasında olmalıdır
vi: Cổng cục bộ phải nằm trong khoảng 1 đến 65535
zh_hans: 本地端口必须介于 1 到 65535 之间
zh_hant: 本機連接埠必須介於 1 到 65535 之間

source: Drop Trigger
fr: Pousse-poussoir à la chute
ko: 트리거 삭제
tr: Tetikleyiciyi Sil
vi: Xoá trigger
zh_hans: 删除触发器
zh_hant: 刪除觸發器

source: %1$lld of %2$lld members
fr: %1$lld de %2$lld membres
ko: 멤버 %2$lld명 중 %1$lld명
tr: %2$lld üyeden %1$lld tanesi
vi: %1$lld trên %2$lld thành viên
zh_hans: %2$lld 位成员中的 %1$lld 位
zh_hant: %2$lld 位成員中的 %1$lld 位

source: PostgreSQL %1$@ needs %2$@ %3$@ to %4$@.
fr: PostgreSQL %1$@ a besoin de %2$@ %3$@ pour %4$@.

source: Membership
fr: Adhésion
ko: 멤버십
tr: Üyelik
vi: Tư cách thành viên
zh_hans: 成员关系
zh_hant: 成員關係

source: Nothing to Copy
fr: Rien à copier

source: Include at least one object to generate a script for it.
fr: Incluez au moins un objet pour générer un script pour lui.
ko: 스크립트를 생성하려면 객체를 하나 이상 포함하십시오.
tr: Bir betik oluşturmak için en az bir nesne dahil edin.
vi: Hãy bao gồm ít nhất một đối tượng để tạo script cho nó.
zh_hans: 请至少包含一个对象，才能为其生成脚本。
zh_hant: 請至少納入一個物件，才能為其產生指令稿。

source: Trigger name
fr: Nom de déclencheur
ko: 트리거 이름
tr: Tetikleyici adı
vi: Tên trigger
zh_hans: 触发器名称
zh_hant: 觸發器名稱

source: Key File
fr: Fichier clé
ko: 키 파일
tr: Anahtar Dosyası
vi: Tệp khóa
zh_hans: 密钥文件
zh_hant: 金鑰檔案

source: Run one statement, or on SQL Server a whole script. Reads need tools:read; anything that writes needs tools:write and is subject to the connection's Safe Mode, which asks the user to approve it. DROP and TRUNCATE go through confirm_destructive_operation instead. Statements that read or write files, or run server-side code, are refused. Send one statement per call, except on SQL Server, where a script runs batch by batch at its GO lines and result_sets lists every result set when there is more than one.
fr: Exécutez une instruction, ou sur SQL Server un tout script. Les lectures nécessitent des outils :read ; tout ce qui écrit nécessite des outils :write et est soumis au mode sûr de la connexion, qui demande à l'utilisateur de l'approuver. DROP et TRUNCATE passent plutôt par confirm_destructive_operation. Les instructions qui lisent ou écrivent des fichiers, ou exécutent du code côté serveur, sont refusées. Envoyez une instruction par appel, sauf sur SQL Server, où un script s'exécute en lots à ses lignes GO et le résultat_sets liste chaque ensemble de résultats lorsqu'il y en a plus d'un.

source: Name or UUID of a TablePro connection
fr: Nom ou UUID d'une connexion TablePro
ko: TablePro 연결의 이름 또는 UUID
tr: Bir TablePro bağlantısının adı veya UUID'si
vi: Tên hoặc UUID của một kết nối TablePro
zh_hans: TablePro 连接的名称或 UUID
zh_hant: TablePro 連線的名稱或 UUID

source: Pick the type of database you want to connect to.
fr: Choisissez le type de base de données à laquelle vous souhaitez vous connecter.
ko: 연결할 데이터베이스 유형을 선택하십시오.
tr: Bağlanmak istediğiniz veritabanı türünü seçin.
vi: Chọn loại cơ sở dữ liệu bạn muốn kết nối.
zh_hans: 选择要连接的数据库类型。
zh_hant: 選擇你要連線的資料庫類型。

source: Save Incomplete
fr: Sauvegarder incomplet
ko: 저장이 완료되지 않음
tr: Kaydetme Tamamlanmadı
vi: Lưu chưa hoàn tất
zh_hans: 保存未完成
zh_hant: 儲存未完成

source: Index type reported by the engine
fr: Type d'indice signalé par le moteur
ko: 엔진이 보고한 인덱스 유형
tr: Motorun bildirdiği indeks türü
vi: Kiểu chỉ mục do engine báo cáo
zh_hans: 引擎报告的索引类型
zh_hant: 引擎回報的索引類型

source: The connection is not open. Connect it first.
fr: La connexion n'est pas ouverte. Connectez-la d'abord.

source: Filter rows with this value
fr: Filtre les lignes avec cette valeur

source: Skip TLS Verification
fr: Oublier la vérification TLS
ko: TLS 검증 건너뛰기
tr: TLS Doğrulamasını Atla
vi: Bỏ qua xác minh TLS
zh_hans: 跳过 TLS 验证
zh_hant: 略過 TLS 驗證

# Port %lld uses TLS, so SSL Mode is %@.
source: Port %1$lld uses TLS, so SSL Mode is %2$@.
fr: Le port %1$lld utilise TLS, donc le mode SSL est %2$@.

source: Its structure could not be read.
fr: Sa structure ne pouvait pas être lu.

source: CHANGED
fr: CHANGÉ
ko: 변경됨
tr: DEĞİŞTİRİLDİ
vi: ĐÃ THAY ĐỔI
zh_hans: 已更改
zh_hant: 已變更

source: Its definition is written in %1$@'s own SQL, which %2$@ does not parse.
fr: Sa définition est écrite dans le propre SQL de %1$@, que %2$@ ne parcourt pas.

source: No connections
fr: Aucune connexion
ko: 연결 없음
tr: Bağlantı yok
vi: Không có kết nối
zh_hans: 没有连接
zh_hant: 沒有連線

source: Insert Row
fr: Insérer une ligne
ko: 행 삽입
tr: Satır Ekle
vi: Thêm dòng
zh_hans: 插入行
zh_hant: 插入列

source: Database URL
fr: URL de la base de données
ko: 데이터베이스 URL
tr: Veritabanı URL
vi: URL cơ sở dữ liệu
zh_hans: 数据库 URL
zh_hant: 資料庫 URL

source: Embedded WASM Postgres over a socket server
fr: WASM Postgres intégré sur un serveur socket.
ko: 소켓 서버를 통한 임베디드 WASM Postgres
tr: Soket sunucusu üzerinden gömülü WASM Postgres
vi: Postgres WASM nhúng chạy qua máy chủ socket
zh_hans: 通过 socket 服务运行的嵌入式 WASM Postgres
zh_hant: 透過 socket 伺服器執行的嵌入式 WASM Postgres

source: Each value is split at every match. Rows with fewer pieces get empty cells.
fr: Chaque valeur est divisée à chaque correspondance. Les lignes avec moins de pièces obtiennent des cellules vides.

# Server error (%d): %@
source: Server error (%1$d): %2$@
fr: Erreur du serveur (%1$d) : %2$@
ko: 서버 오류(%1$d): %2$@
tr: Sunucu hatası (%d): %@
vi: Lỗi máy chủ (%d): %@
zh_hans: 服务器错误（%d）：%@
zh_hant: 伺服器錯誤（%1$d）：%2$@

source: List the saved database connections this client may use, with their live status. Connections the token cannot reach, or that the user blocked for external clients, are omitted.
fr: Listez les connexions de base de données enregistrées que ce client peut utiliser, avec leur statut en direct. Les connexions auxquelles le jeton ne peut pas accéder, ou qui ont été bloquées par l'utilisateur pour les clients externes, sont omises.
ko: 이 클라이언트가 사용할 수 있는 저장된 데이터베이스 연결과 실시간 상태를 나열합니다. 토큰이 접근할 수 없거나 사용자가 외부 클라이언트에 대해 차단한 연결은 제외됩니다.
tr: Bu istemcinin kullanabileceği kayıtlı veritabanı bağlantılarını canlı durumlarıyla listeler. Belirtecin erişemediği veya kullanıcının dış istemcilere kapattığı bağlantılar dahil edilmez.
vi: Liệt kê các kết nối cơ sở dữ liệu đã lưu mà client này được dùng, kèm trạng thái hiện thời. Những kết nối mà token không truy cập được, hoặc người dùng đã chặn với client bên ngoài, sẽ bị bỏ qua.
zh_hans: 列出此客户端可以使用的已保存数据库连接及其实时状态。令牌无法访问的连接，或用户对外部客户端屏蔽的连接，会被略去。
zh_hant: 列出此用戶端可以使用的已儲存資料庫連線及其即時狀態。權杖無法存取的連線，或使用者對外部用戶端封鎖的連線，會被略去。

source: %lld bytes
fr: %lld octets
ko: %lld바이트
tr: %lld bayt
vi: %lld byte
zh_hans: %lld 字节
zh_hant: %lld 位元組

source: No Query History
fr: Aucune historique de requêtes
ko: 쿼리 기록 없음
tr: Sorgu Geçmişi Yok
vi: Không có lịch sử truy vấn
zh_hans: 没有查询历史
zh_hant: 沒有查詢歷史

source: Switch the comparison to Structure to see definitions.
fr: Changez la comparaison en Structure pour voir les définitions.
ko: 정의를 보려면 비교를 구조로 전환하십시오.
tr: Tanımları görmek için karşılaştırmayı Yapı'ya geçirin.
vi: Chuyển so sánh sang Cấu trúc để xem định nghĩa.
zh_hans: 将比较切换到“结构”以查看定义。
zh_hant: 將比較切換到「結構」以查看定義。

source: Event Streaming
fr: Diffusion en direct d'événements
ko: 이벤트 스트리밍
tr: Olay Akışı
zh_hans: 事件流
zh_hant: 事件串流

source: NULL display contains invalid characters (newlines/tabs)
fr: L'affichage NULL contient des caractères invalides (retours de ligne/tabulations)
ko: NULL 표시 값에 잘못된 문자(줄바꿈/탭)가 포함되어 있습니다
tr: NULL görünümü geçersiz karakterler içeriyor (satır sonları/sekmeler)
vi: Hiển thị NULL chứa ký tự không hợp lệ (xuống dòng/tab)
zh_hans: NULL 显示包含无效字符（换行符/制表符）
zh_hant: NULL 顯示包含無效字（換行符／定位字）

source: Preview
fr: Avant-première
ko: 미리보기
tr: Önizleme
vi: Xem trước
zh_hans: 预览
zh_hant: 預覽

source: The destination has no table named %@
fr: La destination n'a pas de table nommée %@

source: Between %@ and %@
fr: Entre %@ et %@
ko: %@에서 %@ 사이
tr: %@ ile %@ arasında
vi: Từ %@ đến %@
zh_hans: 介于 %@ 和 %@ 之间
zh_hant: 介於 %@ 和 %@ 之間

source: Set by the column's collation
fr: Définie par la classification de la colonne
ko: 열의 정렬 규칙에 따라 설정
tr: Sütunun harmanlamasına göre belirlenir
vi: Do đối chiếu của cột quyết định
zh_hans: 由列的排序规则决定
zh_hant: 由欄位的定序決定

source: Body
fr: Corps
ko: 본문
tr: Gövde
vi: Nội dung
zh_hans: 正文
zh_hant: 內文

source: What will run against %@
fr: Ce qui va s'opposer à %@
ko: %@에 대해 실행될 내용
tr: %@ üzerinde ne çalışacak
vi: Những gì sẽ chạy trên %@
zh_hans: 将在 %@ 上运行什么
zh_hant: 將在 %@ 上執行什麼

source: Clear
fr: Clair
ko: 지우기
tr: Temizle
vi: Xóa
zh_hans: 清除
zh_hant: 清除

source: Select a Query
fr: Sélectionnez une requête
ko: 쿼리 선택
vi: Chọn một truy vấn
zh_hans: 选择一个查询
zh_hant: 選擇查詢

source: Running on port %d
fr: Exécuté sur le port %d
ko: 포트 %d에서 실행 중
tr: %d portunda çalışıyor
vi: Đang chạy trên cổng %d
zh_hans: 运行在端口 %d
zh_hant: 執行於連接埠 %d

source: Transfer %1$lld tables into %2$@?
fr: Transférer les tables %1$lld en %2$@?

source: Ref Table
fr: Tableau de référence
ko: 참조 테이블
tr: Referans Tablo
vi: Bảng tham chiếu
zh_hans: 引用表
zh_hant: 參考資料表

source: Show all results
fr: Afficher tous les résultats
ko: 모든 결과 보기
tr: Tüm sonuçları göster
vi: Hiển thị tất cả kết quả
zh_hans: 显示所有结果
zh_hant: 顯示所有結果

source: Allow AI Access
fr: Autoriser l'accès de l'IA
ko: AI 접근 허용
tr: Yapay Zeka Erişimine İzin Ver
vi: Cho phép truy cập AI
zh_hans: 允许 AI 访问
zh_hant: 允許 AI 存取

source: SRID %d is a projected coordinate system. Maps places longitude and latitude only, so these shapes cannot be drawn. Query ST_Transform(geom, 4326) to see them.
fr: SRID %d est un système de coordonnées projeté. Les cartes ne donnent que la longitude et la latitude des lieux, donc ces formes ne peuvent pas être tracées. Demandez ST_Transform(geom, 4326) pour les voir.
